y = int(input("Введіть координату у:"))
x = int(input("Введіть координату х:"))
if y > 0:
    if x > 0:
      print("Перша чверть")
    elif x < 0:
      print("Друга чверть")
    else:
      print("Точка лежить на осі у")
elif y < 0:
     if x > 0:
        print("Четверта чверть")
     elif x < 0:
        print("Третя чверть")
     else:
        print("Точка лежить на осі у")
else:
     if x > 0:
        print("Точка лежить на осі х")
     elif x < 0:
        print("Точка лежить на осі х")
     else:
        print("Точка лежить на початку координат")

